interface activityTypeState {
    [key: string] : string
}

const activityType: activityTypeState = {
    '01' : "การบำเพ็ญประโยชน์ต่อสังคม",
    '02' : "การบำเพ็ญประโยชน์ต่อโรงเรียน",
    '03' : "การอ่านหนังสือ",
    '04' : "การเข้าค่ายวิชาการ",
    '05' : "การเข้าค่ายปฏิบัติธรรม",
    '06' : "การศึกษาดูงานด้านคณิตศาสตร์ วิทยาศาสตร์และเทคโนโลยี",
    '07' : "การศึกษาดูงานด้านสังคมศึกษา ภาษา ศาสนา ศิลปวัฒนธรรมและโบราณคดี",
    '08' : "การฟังบรรยายด้านวิทยาศาสตร์และเทคโนโลยี",
    '09' : "การฟังบรรยายด้านพัฒนาบุคลิกภาพและความฉลาดทางอารมณ์",
    '10' : "การฟังบรรยายด้านสังคมศึกษา ภาษา ศาสนา ศิลปวัฒนธรรมและดนตรี",
    '11' : "การเข้าร่วมกิจกรรมชุมนุม",
    '12' : "การออกกำลังกายและการเล่นกีฬา",
    '13' : "การเข้าร่วมกิจกรรมพบพ่อครู/แม่ครู"
}

export default activityType