import {
  IonPage,
  IonContent,
  IonHeader,
  IonToolbar,
  IonIcon,
  useIonViewWillEnter,
} from "@ionic/react";
import { chevronBack } from "ionicons/icons";
import { useIonRouter } from "@ionic/react";

const SamadetailPage: React.FC = () => {
  const router = useIonRouter();
  const navigateBack = () => {
    if (router.canGoBack()) {
      router.goBack();
    }
  };

  return (
    <IonPage>
      <IonHeader>
        <IonToolbar>
          <div className="flex py-3 pl-5">
            <div onClick={navigateBack} className="mt-2">
              <IonIcon src={chevronBack}></IonIcon>
            </div>
          </div>
        </IonToolbar>
      </IonHeader>
      <IonContent>
        <div className="container p-5 mx-auto text-justify">
            <h1 className="font-bold text-xl mb-3">ประวัติของการบันทึกกิจกรรม</h1>
          <p>
            โรงเรียนวิทยาศาสตร์จุฬาภรณราชวิทยาลัย
            เป็นโรงเรียนที่กรมสามัญศึกษาจัดตั้งขึ้นเพื่อเฉลิมพระเกียรติเนื่องในวโรกาสที่
            ศาสตราจารย์
            ดร.สมเด็จพระเจ้าลูกเธอเจ้าฟ้าจุฬาภรณวลัยลักษณ์อัครราชกุมารี
            ทรงเจริญพระชนมายุครบ 3 รอบ ในวันที่ 4 กรกฎาคม 2536
            ด้วยสำนึกในพระกรุณาธิที่ทรงมุ่งมั่นส่งเสริมคุณภาพชีวิตในด้านความเป็นอยู่และการศึกษาของประชาชน
            โดยเฉพาะในท้องถิ่นห่างไกล
            โดยให้โอกาสแก่เยาวชนที่มีความสนใจและมีความสามารถด้านวิทยาศาสตร์เทคโนโลยีและสิ่งแวดล้อม
            ได้ฝึกฝนความรู้ความสามารถด้านนี้เป็นพิเศษตั้งแต่เยาว์วัย
          </p>
          <br />
          <p>
            ดังนั้นกรมสามัญศึกษาในฐานะหน่วยงานที่รับผิดชอบการจัดการศึกษา
            ในระดับมัธยมศึกษา ได้ประกาศจัดตั้งโรงเรียนเฉลิมพระเกียรติ
            ศาสตราจารย์
            ดร.สมเด็จพระเจ้าลูกเธอเจ้าฟ้าจุฬาภรณวลัยลักษณ์อัครราชกุมารี จำนวน 12
            โรงเรียน ในทุกเขตการศึกษา ปีการศึกษา 2536 จัดตั้ง 4 โรงเรียน คือ
            นครศรีธรรมราช ตรัง เชียงราย และ บุรีรัมย์ ปีการศึกษา 2537 จัดตั้ง 4
            โรงเรียน คือ มุกดาหาร เพชรบุรี สตูล และ เลย ปีการศึกษา 2538 จัดตั้ง
            3 โรงเรียน คือ ลพบุรี พิษณุโลก และ ปทุมธานี ปีการศึกษา 2539 จัดตั้ง
            1 โรงเรียน คือ ชลบุรี
          </p>
          <br />
          <p>
            ได้รับพระราชทานนามว่า โรงเรียนจุฬาภรณราชวิทยาลัย
            ต่อท้ายด้วยชื่อจังหวัดที่เป็นสถานที่ตั้งของโรงเรียน
            พร้อมทั้งพระราชทานแผ่นศิลาฤกษ์โรงเรียนจุฬาภรณราชวิทยาลัย
            ดำเนินการจัดพิธีวางศิลาฤกธิ์พร้อมกันทั่วประเทศ เมื่อวันพุธที่ 17
            มกราคม 2539
          </p>
          <br />
          <p>
            ในวันที่ 9 มีนาคม พ.ศ.2558
            สำนักงานคณะกรรมการการศึกษาขั้นพื้นฐานได้จัดตั้งศูนย์บริหารโครงการพัฒนาโรงเรียนจุฬาภรณราชวิทยาลัยให้เป็นโรงเรียนวิทยาศาสตร์ภูมิภาค
            มีสถานะเป็นกลุ่มงานภายในสำนักวิชาการและมาตรฐานการศึกษา
            เพื่อประสานการดำเนินงานโครงการของคณะกรรมการโครงการฯ
            กับโรงเรียนมหิดลวิทยานุสรณ์ มหาวิทยาลัย นักวิชาการ หน่วยงานต่าง ๆ
            รวมถึงผู้บริหารและบุคลากรของโรงเรียนจุฬาภรณราชวิทยาลัย
            ตลอดจนดำเนินการต่าง ๆ ที่เกี่ยวข้อง ต่อมา
            เปลี่ยนชื่อเป็นศูนย์พัฒนาโรงเรียนวิทยาศาสตร์ เมื่อวันที่ 30 มีนาคม
            พ.ศ.2560
          </p>
          <br />
          <p>
            ตามมติคณะรัฐมนตรีในการประชุม เมื่อวันที่ 25 พฤศจิกายน 2553
            ที่อนุมัติให้กระทรวงศึกษาธิการดำเนินการพัฒนาโรงเรียนจุฬาภรณราชวิทยาลัยทั้ง
            12 แห่ง ให้กลายเป็นโรงเรียนวิทยาศาสตร์ภูมิภาค
            โดยจัดการศึกษาเพื่อให้นักเรียนมีความรู้ความสามารถและศักยภาพทางด้านคณิตศาสตร์และวิทยาศาสตร์ทัดเทียมกับโรงเรียนมหิดลวิทยานุสรณ์
            (องค์การมหาชน) และโรงเรียนวิทยาศาสตร์ชั้นนำในระดับนานาชาติ
            โดยกำหนดแนวทางการจัดอันดับการศึกษาแบบเข้มข้นลึกซึ้งในเนื้อหาทางด้านวิทยาศาสตร์
            คณิตศาสตร์ ปลูกฝังคุณลักษณะทางด้านวิทยาศาสตร์และวิชาการอื่น ๆ
            ตลอดจนปลูกฝังคุณธรรม จริยธรรม
            ส่งเสริมการมีสุขอนามัยที่ดีหากซึ่งกำหนดไว้ในกิจกรรมพัฒนาคุณลักษณะผู้เรียนที่นักเรียนจะต้องทำได้เกิดความยั่งยืนในตัวตนของนักเรียน
            เป็นไปตามมาตรฐานที่กำหนดไว้ ซึ่งจะลดหรือกำหนดให้ต่ำกว่ามาตรฐานไม่ได้
            ซึ่งนักเรียนทุกคนต้องตระหนักในภารกิจดังกล่าวนี้
            จะหลีกเลี่ยงไม่ได้ด้วยประการทั้งปวง
            พร้อมต้องนำเสนอเป็นรูปแบบหลักฐานประกอบการประเมินเสนอต่อผู้ที่เกี่ยวข้องทั้งภายนอกและภายในสถานศึกษา
            โรงเรียนจึงกำหนดรูปแบบการบันทึกกิจกรรมต่าง 1
            สำหรับนักเรียนทุกคนโดยขอให้นักเรียนทุกคนคิดวางแผนเพื่อพัฒนาตนเองให้มีคุณลักษณะตามเกณฑ์ที่กำหนด
            ซึ่งต้องพัฒนาอย่างต่อเนื่องทุกวัน ทุกสัปดาห์ และทุกเดือน
            เชื่อว่าเมื่อเวลาผ่านไปกิจกรรมที่กำหนดนี้จะเป็นสิ่งหนึ่งที่จะทำให้นักเรียนโรงเรียนวิทยาศาสตร์จุฬาภรณราชวิทยาลัย
            ปทุมธานี มีคุณลักษณะที่ดีในการเป็นเยาวชน พลเมืองไทยที่สมบูรณ์
            และมีคุณภาพสูงยิ่งขึ้น
          </p>
          <br />
        </div>
      </IonContent>
    </IonPage>
  );
};
export default SamadetailPage;
